In [1]:
import pandas as pd
from hnmchallenge.data_reader import DataReader
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from hnmchallenge.dataset import Dataset
from hnmchallenge.filtered_dataset import FilterdDataset
from hnmchallenge.stratified_dataset import StratifiedDataset
from hnmchallenge.constant import *
import datetime

In [2]:
dataset = StratifiedDataset()
dr = DataReader()

In [3]:
holdin = dataset.get_holdin()

In [6]:
holdin[[DEFAULT_USER_COL, DEFAULT_ITEM_COL, "t_dat"]].drop_duplicates()

          customer_id  article_id      t_dat
0                   0           0 2018-09-20
2                   0           0 2019-08-05
3                   0         644 2019-08-16
4                   0        1952 2019-10-06
6                   0        1482 2020-04-15
...               ...         ...        ...
10955395      1136204       17478 2020-09-22
10955396      1136205       10033 2020-09-22
10955397      1136205        7580 2020-09-22
10955398      1136205        1765 2020-09-22
10955399      1136205         838 2020-09-22

[9728259 rows x 3 columns]

In [8]:
holdin

              t_dat  customer_id  article_id     price  sales_channel_id
0        2018-09-20            0           0  0.008458                 2
1        2018-09-20            0           0  0.008458                 2
2        2019-08-05            0           0  0.007610                 2
3        2019-08-16            0         644  0.039576                 2
4        2019-10-06            0        1952  0.030492                 2
...             ...          ...         ...       ...               ...
10955395 2020-09-22      1136204       17478  0.042356                 2
10955396 2020-09-22      1136205       10033  0.011847                 2
10955397 2020-09-22      1136205        7580  0.022017                 2
10955398 2020-09-22      1136205        1765  0.016932                 2
10955399 2020-09-22      1136205         838  0.032186                 2

[10955400 rows x 5 columns]

In [7]:
len(holdin)

10955400

In [10]:
holdin.isnull().values.any()

False

In [12]:
from hnmchallenge.features.user_item_features import *

In [15]:
item_df = dr.get_filtered_articles()[DEFAULT_ITEM_COL].to_frame().drop_duplicates()

In [16]:
items = dataset.get_holdin()[DEFAULT_ITEM_COL].unique()

In [17]:
item_df[item_df[DEFAULT_ITEM_COL].isin(items)]

       article_id
0               0
1               1
2               2
3               3
4               4
...           ...
22062       22062
22063       22063
22064       22064
22065       22065
22066       22066

[21131 rows x 1 columns]

In [18]:
item_df

       article_id
0               0
1               1
2               2
3               3
4               4
...           ...
22064       22064
22065       22065
22066       22066
22067       22067
22068       22068

[22069 rows x 1 columns]

In [21]:
dr.get_filtered_articles()["colour_group_code"].to_frame()

       colour_group_code
0                      9
1                      9
2                     72
3                      8
4                      9
...                  ...
22064                  9
22065                 19
22066                 32
22067                 10
22068                 17

[22069 rows x 1 columns]

In [22]:
dr.get_filtered_full_data()

              t_dat  customer_id  article_id     price  sales_channel_id
0        2018-09-20            0           0  0.008458                 2
1        2018-09-20            0           0  0.008458                 2
2        2018-09-20            1           1  0.033881                 1
3        2018-09-20            2           2  0.021593                 1
4        2018-09-20            3           3  0.022017                 2
...             ...          ...         ...       ...               ...
14361083 2020-09-22       198005       20308  0.059305                 2
14361084 2020-09-22       198005       16094  0.042356                 2
14361085 2020-09-22       798833       21707  0.043203                 1
14361086 2020-09-22       395317        4994  0.006763                 1
14361087 2020-09-22       728040       20519  0.033881                 2

[14361088 rows x 5 columns]

In [23]:
dataset.get_holdin()

              t_dat  customer_id  article_id     price  sales_channel_id
0        2018-09-20            0           0  0.008458                 2
1        2018-09-20            0           0  0.008458                 2
2        2019-08-05            0           0  0.007610                 2
3        2019-08-16            0         644  0.039576                 2
4        2019-10-06            0        1952  0.030492                 2
...             ...          ...         ...       ...               ...
10955395 2020-09-22      1136204       17478  0.042356                 2
10955396 2020-09-22      1136205       10033  0.011847                 2
10955397 2020-09-22      1136205        7580  0.022017                 2
10955398 2020-09-22      1136205        1765  0.016932                 2
10955399 2020-09-22      1136205         838  0.032186                 2

[10955400 rows x 5 columns]

In [24]:
dr.get_filtered_customers()

,customer_id,FN,Active,club_member_status,fashion_news_frequency,age,postal_code
0,0,0.0,0.0,ACTIVE,NONE,22.0,6d98a3ca1370c33de04f4a0c2e81cd9c9e36d9501ca6dc...
1,1,0.0,0.0,ACTIVE,NONE,26.0,4845d19cdb5e363f52a5d9899ff2354fb39229c46824e4...
2,2,0.0,0.0,ACTIVE,NONE,53.0,ad36d566f461bead333901eb0f36a7fca1f86cac0e4f9f...
3,3,0.0,0.0,ACTIVE,NONE,38.0,17453ea79bc8f99f3e991b213bf26da9be55693bad8d13...
4,4,1.0,1.0,ACTIVE,Regularly,28.0,3fc82ea96449cbb089311dc2999deda150afd8496337f2...
...,...,...,...,...,...,...,...
1136201,1136201,1.0,1.0,ACTIVE,Regularly,53.0,d5b28659d67f2d3f967c0e7e3dd9653fcc737087880546...
1136202,1136202,0.0,0.0,ACTIVE,NONE,46.0,2c29ae653a9282cce4151bd87643c907644e09541abc28...
1136203,1136203,0.0,0.0,ACTIVE,NONE,19.0,19b57d8db25e3620b7fbe3a3448e39307d62f2a91c5035...
1136204,1136204,0.0,0.0,ACTIVE,NONE,22.0,c00a018625eb885cefe55cf75537079538bd242b8c9eae...
1136205,1136205,1.0,1.0,ACTIVE,Regularly,27.0,37b5f7e769533b36cf12ae9b109da17b7b972c84610d27...